Revit 2027 API
Dimension.Name Property
Retrieves or changes the name associated with the Dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
member Name : string with get, set
Property Value
String
Remarks
The property inherited from element is hidden, a System.InvalidOperationException is thrown.
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace